УправлениеПаркомАттракционов/src/DataProcessors/Бюджет/Бюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Бюджет</name>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЯнварь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФевраль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаМарт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЯнварь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФевраль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаМарт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УправлениеПаркомАттракционов/src/DataProcessors/Бюджет/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходы

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)

	// Посчитаем итого доходов
	ИтогоДоходов = Объект.Доходы.Итог("СуммаЯнварь") 
		+ Объект.Доходы.Итог("СуммаФевраль") 
		+ Объект.Доходы.Итог("СуммаМарт");
		
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы
&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	// Посчитать итого расходов и выведем ошибку, если они превышают доходы
	ИтогоРасходов = Объект.Расходы.Итог("СуммаЯнварь") 
		+ Объект.Расходы.Итог("СуммаФевраль") 
		+ Объект.Расходы.Итог("СуммаМарт");

	Если ИтогоРасходов > ИтогоДоходов Тогда
		Сообщить("Превышены расходы!");
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
